---
kind: property
id: P:Autodesk.Revit.DB.Visual.AssetPropertyInt64.Value
source: html/44a7358c-7966-a876-1890-dd0d1a737105.htm
---
# Autodesk.Revit.DB.Visual.AssetPropertyInt64.Value Property

Get the value of the property.

## Syntax (C#)
```csharp
public long Value { get; }
```